[{"pk": 3, "model": "announcements.announcement", "fields": {"body": "This is the brand new NHS site for the 2012 - 2013 term and forward! I have made countless improvements to the code and performance of this site, and I hope that you appreciate all of the new features.\r\nWith this transition though, I could not migrate all of the data to the new database. Long story short, <strong>everybody's password has been reset. This was done for your security! We are now storing your passwords with a much stronger encryption algorithm. But please be sure to change your password</strong> as soon as you log in. If you need any help, contact your favorite NHS board member.\r\nThe other issue is that not every RSVP has been migrated. I made a number of changes to the way events are stored in the database, meaning I had to add every event by hand again. Since you guys have been so active on this site already (good job!), it was far too time consuming to add each and every RSVP again. So, you can still log in to the old version of the site at <a href=\"http://creeknhs.org:8080\">http://creeknhs.org:8080</a> to view your old RSVPs and add any that may have been lost.\r\nI hope you guys have a productive year!\r\nAustin", "author": 1, "published": "2012-09-10T15:08:00", "slug": "notice", "title": "Notice"}}, {"pk": 2, "model": "announcements.announcement", "fields": {"body": "Hey guys! This is just a reminder that we have a general meeting on Tuesday the 11th. You can come either during 5th period or after school. This meeting is mandatory! If for some reason you can't go to either meeting, contact Paige or me and tell us why you can't come and we can take care of it. ", "author": 260, "published": "2012-09-07T17:03:36", "slug": "general-meeting-reminder", "title": "General Meeting Reminder"}}, {"pk": 4, "model": "announcements.announcement", "fields": {"body": "For those members who received a letter detailing their need to turn in the club contract, agreement, and /or dues. You may find the documents here. Please hand them personally into Marti Benham in the Debate Room (FA625). \r\n", "author": 252, "published": "2012-09-18T11:51:28", "slug": "so-havent-turned-your-forms-yet", "title": "So haven't turned in your forms yet?!"}}, {"pk": 5, "model": "announcements.announcement", "fields": {"body": "Hi everyone! This is a reminder that our second quarter general meeting is this Tuesday the 13th in Shillinglaw during 5th period and after school. If you can't make either meeting, you can contact Paige or me and tell us why you can't make either and we'll take care of it.", "author": 260, "published": "2012-11-07T19:37:30", "slug": "2nd-quarter-general-meeting", "title": "2nd Quarter General Meeting"}}, {"pk": 6, "model": "announcements.announcement", "fields": {"body": "Hey guys, new NHS events! These should be really fun, and I've checked out the Chatfield Botanical Gardens before and they're really nice. Click to sign up and learn more!!\r\n \r\nTrail of Lights\r\n https://www.volgistics.com/ex/portal.dll/ap?AP=1268984102\r\n \r\nBlossoms of Light\r\n https://www.volgistics.com/ex/portal.dll/ap?AP=835242132\r\n \r\nThese are long shifts so you can get your hours done, fast.\r\nThese won't be on this website, but will be counted toward your final hours.", "author": 219, "published": "2012-11-21T09:32:14", "slug": "community-service", "title": "Community Service"}}, {"pk": 7, "model": "announcements.announcement", "fields": {"body": "Events keep getting posted so check back often. Reminder: you need 16 hours by the end of the semester.", "author": 219, "published": "2012-11-27T16:18:11", "slug": "community-service", "title": "Community Service"}}, {"pk": 8, "model": "announcements.announcement", "fields": {"body": "Check out the event for next Wednesday and Thursday! If you come both days, it will count as two different NHS sponsored events. Bring two big bags/ boxes or candy, tea or candy canes and we will give you an extra half hour!", "author": 219, "published": "2012-12-10T19:09:06", "slug": "nhs-sponsored-event", "title": "NHS Sponsored Event"}}, {"pk": 9, "model": "announcements.announcement", "fields": {"body": "Hi everyone! This is just a reminder that hours for 1st semester are due on January 15th. Remember that you need 16 hours total, 4 of which must be tutoring and 4 have to be community service. You must also attend at least 2 NHS sponsored events. The deadline is approaching quickly so if you still have a lot of hours that you still need to do, get them done soon!", "author": 260, "published": "2012-12-11T19:29:12", "slug": "1st-semester-hours", "title": "1st Semester Hours "}}, {"pk": 10, "model": "announcements.announcement", "fields": {"body": "Remember that all hours are due Tuesday the 15th. You need 16 hours total, not including the general meeting hours.", "author": 260, "published": "2013-01-11T18:57:42", "slug": "1st-semester-hours-due-soon", "title": "1st Semester Hours Due Soon!"}}, {"pk": 11, "model": "announcements.announcement", "fields": {"body": "<h3><i class=\"icon-bullhorn\"></i> Hi NHS!\r\n\r\n<h3> Congratulations on serving 4,302.5 hours of service, NHS! \r\nThat's 179 days, 6 hours, & 30 minutes. <i class=\"icon-star-empty\"></i>\r\n\r\n<h3> Our 3rd Quarter will be held on Tuesday, January 29. As usual, you can come 5th or after school for our second semester update! We will also be talking about the application for board members in the upcoming year.\r\n<h3>See you all there!\r\n\r\n<h3> On another note, we will also be notifying members within the next week if they have not completed or turned in their hours.\r\n\r\n<h3> Once more, we can't wait to have an even better second semester!", "author": 252, "published": "2013-01-26T11:34:07", "slug": "h3i-classicon-stari-h3i-classicon-star-emptyi-3rd-", "title": "3rd Quarter General Meeting"}}, {"pk": 13, "model": "announcements.announcement", "fields": {"body": "Hey guys we have a general meeting on Wednesday May 15 during 4th, 5th, or 6th period. You only need to attend one of the periods and attendance is mandatory for both new and returning members. The meeting is in Shilinglaw. There will not be a meeting offered after school so please make room in your schedule to attend during lunch. Also please tell any sophomores or juniors that you know who are new members about the meeting.", "author": 74, "published": "2013-05-08T16:02:06", "slug": "general-meeting-wednesday-may-15", "title": "General Meeting Wednesday May 15"}}, {"pk": 12, "model": "announcements.announcement", "fields": {"body": "<h3><i class=\"icon-pencil\"></i> Are you a current junior? Want to be on board next year?\r\n\r\n<h3> You can check out the link on the welcome page. Or just click <a href=\"http://creeknhs.weebly.com/\">here</a> for the application, and apply by 3:00 p.m., March 7.", "author": 252, "published": "2013-02-12T21:26:14", "slug": "want-be-board-next-year", "title": "Want to be on board next year?"}}, {"pk": 1, "model": "announcements.announcement", "fields": {"body": "Hello NHS members! Welcome to our brand new, cutting-edge, and frankly impressive website for the 2012 - 2013 NHS session.\r\n\r\nOn this website you can:\r\n\r\n*  RSVP for upcoming tutoring or community service events!\r\n*  Keep track of which hours have or have not been verified!\r\n*  Print out lovely event sheets to get signed!\r\n*  Change your password!\r\n*  Give us your number (and email address)!\r\n*  Read about the club!\r\n*  and read these announcements!\r\n\r\nThe basic process here will generally be executed in 3-5 gentle steps:\r\n\r\n1.  **Find an event**\r\n2.  Print out an event sheet\r\n3.  **Attend the event (and get your sheet signed)**\r\n4.  Turn in your signed sheet to the debate room\r\n5.  **Watch us verify your hours**\r\n\r\nThat said, we absolutely encourage making connections at these events and getting involved in more long-term community service or tutoring organizations beyond one-time events as you progress through your high school career. Furthermore, if you already participate in community service and/or tutoring efforts apart from those offered by this club, you can likely use those hours toward your obligations with this club. Just clear it with a board member.\r\n\r\nBut for now, the best thing you can do as a member of this club is get familiar with this site. So poke around, find the events you have RSVP'd for on Facebook or elsewhere and make sure you have RSVP'd for them on this website too, and check for any complications.\r\nIf you complete, private hours. Please use [this sheet](http://creeknhs.org/rsvps/?print=True&blank=True).\r\n\r\nIf you've attended an event already and it doesn't show up (or isn't marked \"Verified\") on the \"Hours\" page, please let me know so we can sort this out.\r\nAnd if you have any questions about the site at all, send them to Ashley or Paige.", "author": 252, "published": "2012-08-31T20:48:22", "slug": "hello", "title": "Hello!"}}]